tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Brew
brew "python"
brew "go"
brew "node"
brew "maven"
brew "yarn"

brew "git"
brew "git-lfs"

brew "mas"
brew "awscli"
brew "cmake"
brew "fish"
brew "htop"
brew "ncdu"
brew "tmux"
brew "mosh"
brew "openvpn"
brew "youtube-dl"
brew "tldr"
brew "tor"

brew "bat"
brew "fd"
brew "fzf"
brew "httpie"
brew "jq"
brew "the_silver_searcher"
brew "tree"
brew "wget"

brew "iperf3"
brew "nmap"
brew "prettyping"
brew "telnet"

brew "imagemagick"
brew "ffmpeg"
brew "flac"
brew "mp3val"

# Shell completions
brew "docker-completion"
brew "docker-compose-completion"

# Casks
tap "homebrew/cask"
cask "google-chrome"
cask "chrome-remote-desktop-host"
cask "firefox"
cask "telegram"
cask "spotify"
cask "musixmatch"

cask "handbrake"
cask "vlc"
cask "adapter"
cask "transmission"
cask "imageoptim"
cask "ios-app-signer"
cask "etcher"
cask "cakebrew"

cask "itsycal"
cask "spectacle"
cask "istat-menus"
cask "alfred"
cask "scroll-reverser"
cask "colorpicker-skalacolor"
cask "sip"
cask "the-unarchiver"

cask "transmit"
cask "cyberduck"
cask "kitematic"
cask "insomnia"
cask "iterm2"
cask "fork"
cask "sequel-pro"
cask "postico"
cask "docker"
cask "java"
cask "android-platform-tools"

cask "sublime-text"
cask "visual-studio-code"
cask "intellij-idea"
cask "texpad"

cask "ngrok"
cask "vnc-viewer"
cask "teamviewer"

# Fonts
tap "homebrew/cask-fonts"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-noto-sans"
cask "font-source-code-pro"

# Mac App Store
mas "Apple Configurator 2", id: 1037126344
mas "GarageBand", id: 682658836
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
mas "LyricsX", id: 1254743014
mas "Stockfish", id: 801463932
mas "HueParty", id: 792963035
