tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brew
## Languages
brew "python"
brew "go"
brew "node"
brew "ruby"

## Package Managers
brew "maven"
brew "yarn"
brew "pipx"

## Shells
brew "fish"

## Dev Tools
### VCS
brew "git"
brew "git-lfs"
brew "gnupg"
brew "pinentry-mac"

### Cloud
brew "awscli"

### Utilities
brew "tmux"
brew "bat"  # Alternative to cat
brew "fd"   # Alternative to find
brew "fzf"  # General-purpose command-line fuzzy finder
brew "ripgrep"  # Recursively searches your current directory for a regex pattern
brew "the_silver_searcher"  # A code searching tool similar to ack, but faster
brew "youtube-dl"
brew "jq"
brew "mas"
brew "tree"
brew "mkcert"
brew "watchman"
brew "tldr"
brew "dockutil"
brew "mackup"
brew "rclone"

### Networking
brew "httpie"
brew "wget"
brew "lftp"
brew "telnet"
brew "iperf3"
brew "nmap"
brew "prettyping"

### System Monitoring
brew "htop"
brew "ncdu"

### Video/Image/PDF processing
brew "ffmpeg"
#brew "ghostscript"
#brew "imagemagick"

### Completions
#brew "docker-completion"
#brew "docker-compose-completion"

# Casks
## Browsers
cask "google-chrome"
cask "firefox"
cask "telegram"

## System Monitoring
cask "coconutbattery"
cask "istat-menus"

## Utilities
cask "itsycal"
cask "transmission"
cask "logitech-options"
cask "barrier"

## Media
cask "iina"
cask "imageoptim"
cask "spotify"

## Dev Tools
cask "alfred"
cask "iterm2"

#cask "intellij-idea"
cask "sublime-text"
cask "visual-studio-code"

cask "sublime-merge"

cask "postico"
cask "tableplus"

# Fonts
tap "homebrew/cask-fonts"
#cask "font-fira-code"
#cask "font-hack"
#cask "font-hasklig"  # Source Code Pro with ligatures
#cask "font-source-code-pro"
#cask "font-inconsolata"
#cask "font-noto-sans"

# Mac App Store
#mas "Apple Configurator 2", id: 1037126344
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "GarageBand", id: 682658836
mas "MainStage 3", id: 634159523
#mas "Xcode", id: 497799835

#mas "Adblock Plus", id: 1432731683
mas "Magnet", id: 441258766
mas "ColorSlurp", id: 1287239339
#mas "MathStudio", id: 829912893
mas "Stockfish", id: 801463932
mas "Trello", id: 1278508951
mas "LyricsX", id: 1254743014
mas "Slack", id: 803453959
