tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brew
## Languages
brew "python"
brew "go"
brew "node"
brew "ruby"

## Package Managers
brew "maven"
brew "yarn"
brew "pipx"

## Shells
brew "fish"

## Dev Tools
### VCS
brew "git"
brew "git-lfs"
brew "gnupg"
brew "pinentry-mac"

### Cloud
brew "awscli"

### Alternatives to common tools
brew "exa"        # Alternative to ls 
brew "bat"        # Alternative to cat
brew "fd"         # Alternative to find
brew "ripgrep"    # Alternative to grep
brew "dog"        # Alternative to dig
brew "duf"        # Alternative to df
brew "ncdu"       # Alternative to du
brew "bottom"     # Alternative to top
brew "htop"
brew "sd"         # Alternative to sed
brew "difftastic" # Alternative to diff
brew "git-delta"  # pager for git
brew "hexyl"      # Alternative to hexdump

brew "tmux"
brew "fzf"        # General-purpose command-line fuzzy finder
brew "youtube-dl"
brew "jq"
brew "mas"
brew "tree"
brew "mkcert"
# brew "watchman"
brew "tldr"      # man
brew "dockutil"
brew "mackup"
brew "rclone"

### Networking
brew "httpie"
brew "xh"
brew "wget"
brew "lftp"
brew "telnet"
brew "iperf3"
brew "nmap"
brew "prettyping"
brew "openconnect"

### Kubernetes
brew "kubernetes-cli"
brew "k9s"
brew "direnv"

### Video/Image/PDF processing
brew "ffmpeg"
#brew "ghostscript"
#brew "imagemagick"

### Completions
#brew "docker-completion"
#brew "docker-compose-completion"

#########
# Casks #
#########

## Browsers
cask "google-chrome"
cask "firefox"

## Messaging
# cask "telegram"

## Utilities
cask "istat-menus"
cask "itsycal"
cask "mouse-fix"
cask "alfred"
cask "raycast"
cask "iterm2"
cask "monitorcontrol"

## Media
cask "iina"
cask "imageoptim"
cask "handbrake"
# cask "spotify"

## Dev Tools
cask "intellij-idea"
cask "sublime-text"
cask "visual-studio-code"

cask "sublime-merge"

cask "postico"
cask "tableplus"

# Drivers
cask "audient-evo"
cask "yamaha-usb-midi-driver"

# Fonts
tap "homebrew/cask-fonts"
#cask "font-fira-code"
#cask "font-hack"
#cask "font-hasklig"  # Source Code Pro with ligatures
#cask "font-source-code-pro"
#cask "font-inconsolata"
#cask "font-noto-sans"

# Mac App Store
#mas "Apple Configurator 2", id: 1037126344
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "GarageBand", id: 682658836
mas "MainStage 3", id: 634159523
#mas "Xcode", id: 497799835

# mas "ColorSlurp", id: 1287239339
# mas "MathStudio", id: 829912893
mas "Telegram", id: 747648890
mas "Stockfish", id: 801463932
mas "Home Assistant", id: 1099568401
# mas "Trello", id: 1278508951
# mas "LyricsX", id: 1254743014
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
