# tap "homebrew/bundle"
# tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# tap "homebrew/services"
# tap "wez/wezterm"

brew "dockutil"
brew "unison"
# brew "grafana"
# brew "zookeeper"
# brew "kafka"
# brew "kind"
# brew "moreutils"
# brew "plow"
# brew "prometheus"
# brew "socat"
# brew "teleport"
# brew "ttyd"
# brew "watch"
# brew "wrk"
# brew "wader/tap/fq"
# brew "sshpass"
# brew "the_silver_searcher"

# brew "go"
# brew "python@3.10"
brew "make"
# brew "corepack"
# brew "node@16"
# brew "yarn"

# brew "golangci-lint"

# brew "stern"
# brew "curl"
# brew "wget"
# brew "direnv"
# brew "git"
# brew "gh"
# brew "jq"
# brew "kubectl"
# brew "rg"
# brew "yq"
brew "openssl"
brew "mysql-client@5.7", link: true
brew "mysql@5.7"
# brew "s3cmd"
brew "vault"
brew "terraform"
# brew "awscli"
# brew "doctl"
# brew "kcat"
# brew "redis"
# brew link --overwrite --force mysql-client@5.7

# mas "GarageBand", id: 682658836
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541

cask "alfred"
cask "arc"
cask "google-chrome"
cask "firefox"
# cask "fork"
cask "github"
cask "istat-menus"
cask "itsycal"
cask "keepingyouawake"
cask "1password"
# cask "lens"
cask "raycast"
cask "rectangle"
# cask "rustdesk"
# cask "sloth" # shows all open files and sockets in use by all running processes on your system
cask "stats"
cask "sublime-merge"
cask "sublime-text"
# cask "syncthing"
# cask "tableplus"
# cask "tailscale"
cask "trex"
cask "visual-studio-code@insiders"
# cask "wezterm"
cask "iina"
cask "zed"
cask "mac-mouse-fix"
cask "google-drive"

cask "licecap"
cask "kap"
cask "keycastr"
cask "slack"
cask "visual-studio-code"
# cask "zoom"
cask "1password-cli"
cask "goland"
cask "iterm2"
# cask "docker"
cask "orbstack"
cask "devpod"
cask "fly"

cask "beekeeper-studio"
cask "tableplus"
cask "postman"
cask "wireshark-app"
cask "insomnia"
cask "fork"

cask "ghostty"
cask "spotify"

cask "gitify"
# cask "devhub"
cask "trailer"

cask "swiftdefaultappsprefpane"
